tutorialsDyM/FallingSphere3D/sphereAndBackground/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.0075;

vertices
(
    (-6.66 -6.66 -16)
    (6.66 -6.66 -16)
    (6.66 6.66 -16)
    (-6.66 6.66 -16)
    (-6.66 -6.66 5.3)
    (6.66 -6.66 5.3)
    (6.66 6.66 5.3)
    (-6.66 6.66 5.3)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)  (40 40 60) simpleGrading (1 1 1)
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
    Bottom
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }

    inlet
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }

    frontAndBack
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }

);

mergePatchPairs
(
);


// ************************************************************************* //
