tutorialsDyM/FallingSphere3D/sphereAndBackground/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    cellDisplacement
    {
        solver          PCG;
        preconditioner  DIC;

        tolerance       1e-7;
        relTol          0;
        maxIter         100;
    }

    p_rbgh
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.0;
        maxIter         10;
    }

    p_rbghFinal
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.0;
    }

    pcorr
    {
        $pFinal;
        solver          PCG;
        preconditioner  DIC;
        tolerance 1e-7;
        relTol 0.0;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0.;
        tolerance 1e-7;
    }

    "(U.a|U.b|alpha.a|pa|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.0;
    }

    "(U.a|U.b|alpha.a|pa|k|epsilon)Final"
    {
        $pa;
        tolerance       1e-8;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   no;
    correctPhi          true;
    nOuterCorrectors    1;
    nCorrectors         1;
    nAlphaCorr      1;

    nNonOrthogonalCorrectors 0;
    massFluxInterpolation true;
    ddtCorr             false;
    turbOnFinalIterOnly false;
    moveMeshOuterCorrectors yes;
}

relaxationFactors
{
    fields
    {
        p_rbgh               1;
    }
    equations
    {
        "(U|k|omega)"   1;
        ".*Final"        1.0;
    }
}


// ************************************************************************* //
